import numpy as np

A = np.array([
    [1,0,1],
    [2,2,1],
    [0,1,1]
], dtype=float)

I = np.array([
    [1,0,0],
    [0,1,0],
    [0,0,1]
])
# Для горизонтального объединения используем:
M = np.hstack((A, I))
print(M)

M[1] = M[1]-2*M[0]
M[1] = M[1]/2
M[2] = M[2]-M[1]
M[2] = M[2]/1.5
M[0] = M[0]-M[2]
M[1] = M[1] - (- 0.5) * M[2]
print(M)
# Встроенная функция нахождения обратной функции
print(np.linalg.inv(A))

# Quter Product
M1 = np.outer(A[:,0], I[0,:])
M2 = np.outer(A[:,1], I[1,:])
M3 = np.outer(A[:,2], I[2,:])
print (M1+M2+M3)
# Сингулярность
B = np.array([
    [1,2],
    [3,6]
])

# print( np.linalg.inv(B)) Так как видно, что столбцы матрицы пропорциональны
# соответственно матрица B - сингулярная
# Следовательно мы не можем найти для нее обратную
